# LevelAttrRoomComputationAutomatic Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LevelAttrRoomComputationAutomatic Property
ParameterTypeId Class See Also
---
"Automatic Room Computation Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LevelAttrRoomComputationAutomatic { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelAttrRoomComputationAutomatic As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LevelAttrRoomComputationAutomatic {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace